- 여러개의 데이터르 ㄹ이어붙이는 함수
- 조건없이 그냥 이어붙임
- 방향: 위아래 / 옆으로}

In [13]:
import numpy as np
import pandas as pd

In [14]:
df1 = pd.DataFrame({'학번':[1,2,3],'이름':['철수','영희','민수']})
df2 = pd.DataFrame({'학번':[1,2,4], '점수':[90,85,70]})

In [16]:
# pd.concat(리스트)
# 방향 : 기본값 axis = 0 (y축 위아래)
# pd.concat([데이터리스트, 방향])
print(pd.concat([df1,df2]))
print('\n')
# axis=1 (x축 옆으로)
pd.concat([df1,df2], axis=1)

   학번   이름    점수
0   1   철수   NaN
1   2   영희   NaN
2   3   민수   NaN
0   1  NaN  90.0
1   2  NaN  85.0
2   4  NaN  70.0

   학번  이름  학번  점수
0   1  철수   1  90
1   2  영희   2  85
2   3  민수   4  70

In [6]:
# concat 후에 인덱스 재설정
# pd.concat(리스트,index옵션)
# True : 기존 인덱스를 무시하고 순차적 부여
pd.concat([df1,df2], ignore_index=True)

   학번   이름    점수
0   1   철수   NaN
1   2   영희   NaN
2   3   민수   NaN
3   1  NaN  90.0
4   2  NaN  85.0
5   4  NaN  70.0

In [7]:
df1 = pd.DataFrame({'사번':[1,2],'이름':['홍길동','임꺽정']})
df2 = pd.DataFrame({'부서':['영업','개발']})
pd.concat([df1,df2], axis=1)

   사번   이름  부서
0   1  홍길동  영업
1   2  임꺽정  개발

In [9]:
df1 = pd.DataFrame({'매출':[100,200]})
df2 = pd.DataFrame({'매출':[150,250]})
df3 = pd.DataFrame({'매출':[300,400]})
pd.concat([df1,df2,df3],ignore_index=True)

    매출
0  100
1  200
2  150
3  250
4  300
5  400

In [11]:
df1 = pd.DataFrame({'이름':['철수','영희'],'국어':[85,90]})
df2 = pd.DataFrame({'이름':['민수','지연'],'수학':[78,92]})
pd.concat([df1,df2], axis=1)

   이름  국어  이름  수학
0  철수  85  민수  78
1  영희  90  지연  92